app/controllers/users_controller.rb

INSERT INTO "users" ("latitude", "longitude", "address", "description", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "latitude" = ?, "longitude" = ?, "address" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["latitude", 40.7127753], ["longitude", -74.0059728], ["address", "New York "], ["updated_at", "2017-11-29 14:54:52.303818"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)